In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect("example.db")

In [3]:
cursor = connection.cursor()
cursor.execute('''
create table if not exists employees(
               id integer primary key,
               name text not null,
               age integer,
               department text
               
               )
''')
connection.commit()

In [4]:
cursor.execute('select * from employees')

In [8]:
cursor.execute('''
insert into employees (name,age,department)
               values('Varun Reddy Dyapa',25,'Developer')
''')

cursor.execute('''
insert into employees (name,age,department)
               values('Tharun Reddy Dyapa',22,'Finance')
''')

connection.commit()

In [9]:
cursor.execute('Select * from employees')
rows=cursor.fetchall()
rows

[(1, 'Varun Reddy Dyapa', 25, 'Developer'),
 (2, 'Varun Reddy Dyapa', 25, 'Developer'),
 (3, 'Tharun Reddy Dyapa', 22, 'Finance')]

In [11]:
cursor.execute('''
delete from employees where id = 1
''')
connection.commit()

In [12]:
cursor.execute('Select * from employees')
rows=cursor.fetchall()
rows

[(2, 'Varun Reddy Dyapa', 25, 'Developer'),
 (3, 'Tharun Reddy Dyapa', 22, 'Finance')]

In [13]:
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

In [14]:
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [15]:
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()
rows

[(1, '2023-01-01', 'Product1', 100, 'North'),
 (2, '2023-01-02', 'Product2', 200, 'South'),
 (3, '2023-01-03', 'Product1', 150, 'East'),
 (4, '2023-01-04', 'Product3', 250, 'West'),
 (5, '2023-01-05', 'Product2', 300, 'North')]